name: Cloud Compute Instance Created By Previously Unseen User
id: 37a0ec8d-827e-4d6d-8025-cedf31f3a149
version: 2
date: '2021-07-13'
author: Rico Valdez, Splunk
type: Anomaly
datamodel:
- Change
description: This search looks for cloud compute instances created by users who have
  not created them before.
search: '| tstats `security_content_summariesonly` count earliest(_time) as firstTime,
  latest(_time) as lastTime values(All_Changes.object) as dest from datamodel=Change
  where All_Changes.action=created by All_Changes.user All_Changes.vendor_region |
  `drop_dm_object_name("All_Changes")` | lookup previously_seen_cloud_compute_creations_by_user
  user as user OUTPUTNEW firstTimeSeen, enough_data | eventstats max(enough_data)
  as enough_data | where enough_data=1 | eval firstTimeSeenUser=min(firstTimeSeen)
  | where isnull(firstTimeSeenUser) OR firstTimeSeenUser > relative_time(now(), "-24h@h")
  | table firstTime, user, dest, count vendor_region | `security_content_ctime(firstTime)`
  | `cloud_compute_instance_created_by_previously_unseen_user_filter`'
how_to_implement: You must be ingesting the appropriate cloud-infrastructure logs
  Run the "Previously Seen Cloud Compute Creations By User" support search to create
  of baseline of previously seen users.
known_false_positives: It's possible that a user will start to create compute instances
  for the first time, for any number of reasons. Verify with the user launching instances
  that this is the intended behavior.
references: []
tags:
  analytic_story:
  - Cloud Cryptomining
  asset_type: Cloud Compute Instance
  automated_detection_testing: passed
  cis20:
  - CIS 1
  confidence: 60
  context:
  - Source:Cloud Data
  - Scope:External
  - Outcome:Allowed
  - Stage:Recon
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/suspicious_behaviour/abnormally_high_cloud_instances_launched/cloudtrail_behavioural_detections.json
  impact: 30
  message: User $user$ is creating a new instance $dest$ for the first time
  mitre_attack_id:
  - T1078.004
  - T1078
  nist:
  - ID.AM
  observable:
  - name: user
    type: User
    role:
    - Attacker
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Security Analytics for AWS
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Changes.object
  - All_Changes.action
  - All_Changes.user
  - All_Changes.vendor_region
  risk_score: 18
  security_domain: threat
  required_tas:
  - Splunk_TA_citrix-netscaler
  - Splunk_TA_nix
  - Splunk_TA_rsa-securid
  - Splunk_TA_aws-kinesis-firehose
  - Splunk_TA_rsa_securid_cas
  - Splunk_TA_jboss
  - Splunk_TA_ossec
  - Splunk_TA_juniper
  - splunk_ta_o365
  - Splunk_TA_symantec-ep
  - Splunk_TA_sophos
  - Splunk_TA_cyberark
  - Splunk_TA_microsoft-hyperv
  - Splunk_TA_windows
  - Splunk_TA_box
  - Splunk_TA_CrowdStrike_FDR
  - Splunk_TA_cisco-asa
  - Splunk_TA_infoblox
  - Splunk_TA_salesforce
  - Splunk_TA_linux
