name: Previously Seen Cloud Compute Creations By User - Update
id: 6bf75d69-7766-47bc-8097-e41696807a6f
version: 1
date: '2020-08-15'
author: Rico Valdez, Splunk
type: Baseline
datamodel:
- Change
description: This search builds a table of previously seen users that have launched
  a cloud compute instance.
search: '| tstats earliest(_time) as firstTimeSeen, latest(_time) as lastTimeSeen
  from datamodel=Change where All_Changes.action=created AND All_Changes.object_category=instance
  by All_Changes.user| `drop_dm_object_name("All_Changes")` | inputlookup append=t
  previously_seen_cloud_compute_creations_by_user | stats min(firstTimeSeen) as firstTimeSeen
  max(lastTimeSeen) as lastTimeSeen by user | where lastTimeSeen > relative_time(now(),
  "-90d@d") | eventstats min(firstTimeSeen) as globalFirstTime | eval enough_data
  = if(globalFirstTime <= relative_time(now(), "-7d@d"), 1, 0) | outputlookup previously_seen_cloud_compute_creations_by_user'
how_to_implement: You must be ingesting the approrpiate cloud infrastructure logs
  and have the proper TAs installed.
known_false_positives: none
references: []
tags:
  analytic_story:
  - Cloud Cryptomining
  deployments:
  - Daily Cache Updates
  detections:
  - Cloud Compute Instance Created By Previously Unseen User
  product:
  - Splunk Security Analytics for AWS
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Changes.action
  - All_Changes.object_category
  - All_Changes.user
  security_domain: network
  required_tas:
  - Splunk_TA_citrix-netscaler
  - Splunk_TA_nix
  - Splunk_TA_aws-kinesis-firehose
  - Splunk_TA_ossec
  - Splunk_TA_juniper
  - splunk_ta_o365
  - Splunk_TA_symantec-ep
  - Splunk_TA_sophos
  - Splunk_TA_cyberark
  - Splunk_TA_windows
  - Splunk_TA_CrowdStrike_FDR
  - Splunk_TA_cisco-asa
  - Splunk_TA_infoblox
  - Splunk_TA_salesforce
  - Splunk_TA_cyberark_epm
