name: Previously Seen Cloud Compute Instance Types - Initial
id: 3c78025c-1ffe-4976-a640-75ef604842be
version: 1
date: 2020-9-03
author: David Dorsey, Splunk
type: Baseline
datamodel:
- Change
description: This search builds a table of previously seen cloud compute instance
  types
search: '| tstats earliest(_time) as firstTimeSeen, latest(_time) as lastTimeSeen
  from datamodel=Change where All_Changes.action=created by All_Changes.Instance_Changes.instance_type
  | `drop_dm_object_name("All_Changes.Instance_Changes")` | where instance_type !=
  "unknown" | eventstats min(firstTimeSeen) as globalFirstTime | eval enough_data
  = if(globalFirstTime <= relative_time(now(), "-14d@d"), 1, 0) | outputlookup previously_seen_cloud_compute_instance_types'
how_to_implement: You must be ingesting the approrpiate cloud infrastructure logs
  and have the Security Research cloud data model installed.
known_false_positives: none
references: []
tags:
  analytic_story:
  - Cloud Cryptomining
  deployments:
  - 90 Day Baseline
  detections:
  - Cloud Compute Instance Created With Previously Unseen Instance Type
  product:
  - Splunk Security Analytics for AWS
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Changes.action
  - All_Changes.Instance_Changes.instance_type
  security_domain: network
  required_tas:
  - Splunk_TA_citrix-netscaler
  - Splunk_TA_nix
  - Splunk_TA_nginx
  - Splunk_TA_microsoft-iis
  - Splunk_TA_microsoft-sqlserver
  - Splunk_TA_bluecoat-proxysg
  - Splunk_TA_aws-kinesis-firehose
  - Splunk_TA_jboss
  - Splunk_TA_websense-cg
  - Splunk_TA_ossec
  - Splunk_TA_bromium
  - Splunk_TA_bit9-carbonblack
  - Splunk_TA_squid
  - Splunk_TA_apache
  - Splunk_TA_juniper
  - Splunk_TA_cisco-esa
  - splunk_ta_o365
  - Splunk_TA_f5-bigip
  - Splunk_TA_symantec-ep
  - Splunk_TA_google-cloudplatform
  - Splunk_TA_sophos
  - Splunk_TA_haproxy
  - Splunk_TA_tomcat
  - Splunk_TA_cyberark
  - Splunk_TA_ibm-was
  - Splunk_TA_windows
  - Splunk_TA_mcafee-wg
  - Splunk_TA_isc-dhcp
  - Splunk_TA_box
  - Splunk_TA_CrowdStrike_FDR
  - Splunk_TA_cisco-wsa
  - Splunk_TA_mysql
  - Splunk_TA_cisco-asa
  - Splunk_TA_infoblox
  - Splunk_TA_salesforce
  - Splunk_TA_cyberark_epm
  - Splunk_TA_linux
