name: Count of Unique IPs Connecting to Ports
id: 9f3bae5a-9fe3-49df-8c84-5edc51d84b7f
version: 1
date: '2017-09-13'
author: David Dorsey, Splunk
type: Baseline
datamodel:
- Network_Traffic
description: The search counts the number of times a connection was observed to each
  destination port, and the number of unique source IPs connecting to them.
search: '| tstats `security_content_summariesonly` count dc(All_Traffic.src) as numberOfUniqueHosts
  from datamodel=Network_Traffic by All_Traffic.dest_port | `drop_dm_object_name("All_Traffic")`
  | sort - count'
how_to_implement: To successfully implement this search, you must be ingesting network
  traffic, and populating the Network_Traffic data model.
known_false_positives: none
references: []
tags:
  deployments:
  - Daily Cache Updates
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Traffic.dest_port
  - All_Traffic.src
  security_domain: network
  required_tas:
  - Splunk_TA_citrix-netscaler
  - Splunk_TA_nix
  - Splunk_TA_nginx
  - Splunk_TA_microsoft-iis
  - Splunk_TA_bluecoat-proxysg
  - Splunk_TA_aws-kinesis-firehose
  - Splunk_TA_jboss
  - Splunk_TA_ossec
  - Splunk_TA_bit9-carbonblack
  - Splunk_TA_squid
  - Splunk_TA_apache
  - Splunk_TA_juniper
  - Splunk_TA_f5-bigip
  - Splunk_TA_symantec-ep
  - Splunk_TA_sophos
  - Splunk_TA_haproxy
  - Splunk_TA_tomcat
  - Splunk_TA_windows
  - Splunk_TA_mcafee-wg
  - Splunk_TA_CrowdStrike_FDR
  - Splunk_TA_cisco-wsa
  - Splunk_TA_cisco-asa
  - Splunk_TA_infoblox
  - Splunk_TA_salesforce
