name: Get Certificate logs for a domain
id: bc91a8cf-35e7-4bb2-2240-e756cc06fd73
version: 2
date: '2019-04-29'
author: Bhavin Patel, Splunk
type: Investigation
datamodel: []
description: This search queries the Certificates datamodel and give you all the information
  for a specific domain. Please note that the certificates issued by "Let's Encrypt"
  are widely used by attackers.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Certificates.All_Certificates where All_Certificates.SSL.ssl_subject_common_name=*$domain$  by
  All_Certificates.dest All_Certificates.src All_Certificates.SSL.ssl_issuer_common_name
  All_Certificates.SSL.ssl_subject_common_name All_Certificates.SSL.ssl_hash | `drop_dm_object_name(All_Certificates)`
  | `drop_dm_object_name(SSL)` | rename ssl_subject_common_name as domain | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`'
how_to_implement: You must be ingesting your certificates or SSL logs from your network
  traffic into your Certificates datamodel. Please note the wildcard(*) before domain
  in the search syntax, we use to match for all domain and subdomain combinations
known_false_positives: ''
references: []
tags:
  analytic_story:
  - Common Phishing Frameworks
  product:
  - Splunk Phantom
  required_fields:
  - _time
  - All_Certificates.SSL.ssl_subject_common_name
  - All_Certificates.dest
  - All_Certificates.src
  - All_Certificates.SSL.ssl_issuer_common_name
  - All_Certificates.SSL.ssl_hash
  security_domain: network
  required_tas:
  - Splunk_TA_citrix-netscaler
  - Splunk_TA_nix
  - Splunk_TA_nginx
  - Splunk_TA_microsoft-iis
  - Splunk_TA_microsoft-sqlserver
  - Splunk_TA_bluecoat-proxysg
  - Splunk_TA_aws-kinesis-firehose
  - Splunk_TA_jboss
  - Splunk_TA_websense-cg
  - Splunk_TA_ossec
  - Splunk_TA_bromium
  - Splunk_TA_nagios-core
  - Splunk_TA_isc-bind
  - Splunk_TA_bit9-carbonblack
  - Splunk_TA_squid
  - Splunk_TA_apache
  - Splunk_TA_juniper
  - Splunk_TA_cisco-esa
  - splunk_ta_o365
  - Splunk_TA_f5-bigip
  - Splunk_TA_symantec-ep
  - Splunk_TA_sophos
  - Splunk_TA_haproxy
  - Splunk_TA_tomcat
  - Splunk_TA_cyberark
  - Splunk_TA_symantec-dlp
  - Splunk_TA_ibm-was
  - Splunk_TA_windows
  - Splunk_TA_mcafee-wg
  - Splunk_TA_isc-dhcp
  - Splunk_TA_microsoft-scom
  - Splunk_TA_CrowdStrike_FDR
  - Splunk_TA_cisco-wsa
  - Splunk_TA_mysql
  - Splunk_TA_cisco-asa
  - Splunk_TA_infoblox
  - Splunk_TA_salesforce
