name: Identify Systems Receiving Remote Desktop Traffic
id: baaeea15-fe8a-4090-92c2-5b60943bb608
version: 1
date: '2017-09-15'
author: David Dorsey, Splunk
type: Baseline
datamodel:
- Network_Traffic
description: This search counts the numbers of times the system has created remote
  desktop traffic
search: '| tstats `security_content_summariesonly` count from datamodel=Network_Traffic
  where All_Traffic.dest_port=3389 by All_Traffic.dest | `drop_dm_object_name("All_Traffic")`
  | sort - count'
how_to_implement: To successfully implement this search you must ingest network traffic
  and populate the Network_Traffic data model. If a system receives a lot of remote
  desktop traffic, you can apply the category common_rdp_destination to it.
known_false_positives: none
references: []
tags:
  deployments:
  - Daily Cache Updates
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Traffic.dest_port
  - All_Traffic.dest
  security_domain: network
  required_tas:
  - Splunk_TA_citrix-netscaler
  - Splunk_TA_nix
  - Splunk_TA_nginx
  - Splunk_TA_microsoft-iis
  - Splunk_TA_bluecoat-proxysg
  - Splunk_TA_aws-kinesis-firehose
  - Splunk_TA_jboss
  - Splunk_TA_ossec
  - Splunk_TA_bit9-carbonblack
  - Splunk_TA_squid
  - Splunk_TA_apache
  - Splunk_TA_juniper
  - Splunk_TA_f5-bigip
  - Splunk_TA_symantec-ep
  - Splunk_TA_sophos
  - Splunk_TA_haproxy
  - Splunk_TA_tomcat
  - Splunk_TA_windows
  - Splunk_TA_mcafee-wg
  - Splunk_TA_CrowdStrike_FDR
  - Splunk_TA_cisco-wsa
  - Splunk_TA_cisco-asa
  - Splunk_TA_infoblox
  - Splunk_TA_salesforce
