name: Investigate Failed Logins for Multiple Destinations
id: 097e8030-8662-4254-a735-bf0bdda696e3
version: 1
date: '2019-12-10'
author: Patrick Bareiss, Splunk
type: Investigation
datamodel:
- Authentication
description: This search returns failed logins to multiple destinations by user.
search: '| tstats count `security_content_summariesonly` earliest(_time) as first_login
  latest(_time) as last_login dc(Authentication.dest) AS distinct_count_dest values(Authentication.dest)
  AS Authentication.dest values(Authentication.app) AS Authentication.app  from datamodel=Authentication
  where Authentication.action=failure by Authentication.user | where distinct_count_dest
  > 1 | `security_content_ctime(first_login)` | `security_content_ctime(last_login)`
  | `drop_dm_object_name("Authentication")` | search user=$user$'
how_to_implement: To successfully implement this search you need to be ingesting authentication
  logs from your various systems and populating the Authentication data model.
known_false_positives: ''
references: []
tags:
  analytic_story:
  - Credential Dumping
  product:
  - Splunk Phantom
  required_fields:
  - _time
  - Authentication.dest
  - Authentication.app
  - Authentication.action
  - Authentication.user
  security_domain: endpoint
  required_tas:
  - Splunk_TA_citrix-netscaler
  - Splunk_TA_nix
  - Splunk_TA_nginx
  - Splunk_TA_microsoft-iis
  - Splunk_TA_microsoft-sqlserver
  - Splunk_TA_bluecoat-proxysg
  - Splunk_TA_aws-kinesis-firehose
  - Splunk_TA_websense-cg
  - Splunk_TA_ossec
  - Splunk_TA_bit9-carbonblack
  - Splunk_TA_squid
  - Splunk_TA_juniper
  - Splunk_TA_cisco-esa
  - splunk_ta_o365
  - Splunk_TA_f5-bigip
  - Splunk_TA_symantec-ep
  - Splunk_TA_google-cloudplatform
  - Splunk_TA_cyberark
  - Splunk_TA_windows
  - Splunk_TA_mcafee-wg
  - Splunk_TA_box
  - Splunk_TA_CrowdStrike_FDR
  - Splunk_TA_cisco-asa
  - Splunk_TA_infoblox
  - Splunk_TA_salesforce
