name: Investigate Previous Unseen User
id: 5de385bf-4f1e-404e-9b67-92d162ff8938ad
version: 1
date: '2019-12-10'
author: Patrick Bareiss, Splunk
type: Investigation
datamodel:
- Authentication
description: This search returns previous unseen user, which didn't log in for 30
  days.
search: '| tstats count `security_content_summariesonly` earliest(_time) as first_login
  latest(_time) as last_login values(Authentication.dest) AS Authentication.dest values(Authentication.app)
  AS Authentication.app values(Authentication.action) AS Authentication.action from
  datamodel=Authentication where Authentication.action=success by _time, Authentication.user
  | bucket _time span=30d | stats count min(first_login) as first_login max(last_login)
  as last_login values(Authentication.dest) AS Authentication.dest by Authentication.user
  | where count=1 | where first_login >= relative_time(now(), "-30d") | `security_content_ctime(first_login)`
  | `security_content_ctime(last_login)` | `drop_dm_object_name("Authentication")`
  | search dest=$dest$'
how_to_implement: To successfully implement this search you need to be ingesting authentication
  logs from your various systems and populating the Authentication data model.
known_false_positives: ''
references: []
tags:
  analytic_story:
  - Credential Dumping
  product:
  - Splunk Phantom
  required_fields:
  - _time
  - Authentication.dest
  - Authentication.app
  - Authentication.action
  - Authentication.user
  security_domain: endpoint
  required_tas:
  - Splunk_TA_citrix-netscaler
  - Splunk_TA_nix
  - Splunk_TA_nginx
  - Splunk_TA_microsoft-iis
  - Splunk_TA_microsoft-sqlserver
  - Splunk_TA_bluecoat-proxysg
  - Splunk_TA_aws-kinesis-firehose
  - Splunk_TA_websense-cg
  - Splunk_TA_ossec
  - Splunk_TA_bit9-carbonblack
  - Splunk_TA_squid
  - Splunk_TA_juniper
  - Splunk_TA_cisco-esa
  - splunk_ta_o365
  - Splunk_TA_f5-bigip
  - Splunk_TA_symantec-ep
  - Splunk_TA_cyberark
  - Splunk_TA_windows
  - Splunk_TA_mcafee-wg
  - Splunk_TA_CrowdStrike_FDR
  - Splunk_TA_cisco-asa
  - Splunk_TA_infoblox
  - Splunk_TA_salesforce
