name: Windows Updates Install Failures
id: 6a4dbd1b-4502-4a11-943a-82b5ae7a42d7
version: 1
date: '2017-09-14'
author: David Dorsey, Splunk
type: Baseline
datamodel: []
description: This search is intended to give you a feel for how often Windows updates
  fail to install in your environment. Fluctuations in these numbers will allow you
  to determine when you should be concerned.
search: '| tstats `security_content_summariesonly` dc(Updates.dest) as count FROM
  datamodel=Updates where Updates.vendor_product="Microsoft Windows" AND Updates.status=failure
  by _time span=1d'
how_to_implement: You must be ingesting your Windows Update Logs
known_false_positives: none
references: []
tags:
  deployments:
  - Daily Cache Updates
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Updates.vendor_product
  - Updates.status
  security_domain: endpoint
  required_tas:
  - Splunk_TA_cisco-ucs
  - Splunk_TA_citrix-netscaler
  - Splunk_TA_nix
  - Splunk_TA_nginx
  - Splunk_TA_microsoft-iis
  - Splunk_TA_microsoft-sqlserver
  - Splunk_TA_bluecoat-proxysg
  - Splunk_TA_aws-kinesis-firehose
  - Splunk_TA_jboss
  - Splunk_TA_websense-cg
  - Splunk_TA_ossec
  - Splunk_TA_bit9-carbonblack
  - Splunk_TA_squid
  - Splunk_TA_apache
  - Splunk_TA_juniper
  - splunk_ta_o365
  - Splunk_TA_f5-bigip
  - Splunk_TA_symantec-ep
  - Splunk_TA_sophos
  - Splunk_TA_haproxy
  - Splunk_TA_tomcat
  - Splunk_TA_cyberark
  - Splunk_TA_ibm-was
  - Splunk_TA_windows
  - Splunk_TA_mcafee-wg
  - Splunk_TA_CrowdStrike_FDR
  - Splunk_TA_cisco-wsa
  - Splunk_TA_cisco-asa
  - Splunk_TA_infoblox
  - Splunk_TA_salesforce
  - Splunk_TA_cyberark_epm
